tap "graalvm/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "micronaut-projects/tap"
tap "mvndaemon/mvnd"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Official Amazon AWS command-line interface
brew "awscli"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Core application library for C
brew "glib"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Configurable talking characters in ASCII art
brew "cowsay"
# Tool for exploring each layer in a docker image
brew "dive"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# OpenType text shaping engine
brew "harfbuzz"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Secure Reliable Transport
brew "srt"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg@4"
# GitHub command-line tool
brew "gh"
# Highest-quality GIF encoder based on pngquant
brew "gifski"
# Distributed revision control system
brew "git"
# X.509 and CMS library
brew "libksba"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg@1.4"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Manage compile and link flags for libraries
brew "pkg-config"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Reformats Java source code to comply with Google Java Style
brew "google-java-format"
# Human friendly `go test` runner
brew "gotestsum"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Generic library support script
brew "libtool"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU grep, egrep and fgrep
brew "grep"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Manage your Java environment
brew "jenv"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Anti-bikeshedding Kotlin linter with built-in formatter
brew "ktlint"
# FAST Kubernetes manifests validator, with support for Custom Resources!
brew "kubeconform"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Sophisticated file transfer program
brew "lftp"
# YAML Parser
brew "libyaml"
# Java-based project management
brew "maven"
# Run a Kubernetes cluster locally
brew "minikube"
# HTTP/2 C Library
brew "nghttp2"
# Platform built on V8 to build network applications
brew "node"
# Manage multiple Node.js versions
brew "nvm"
# Object-relational database system
brew "postgresql@14"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Repository tool for Android development
brew "repo"
# Login and retrieve AWS temporary credentials using a SAML IDP
brew "saml2aws"
# Simple keystroke visualizer
brew "showkey"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Terraform version manager inspired by rbenv
brew "tfenv"
# Programmatically correct mistyped console commands
brew "thefuck"
# Tool for packaging, publishing and managing VS Code extensions
brew "vsce"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Linter for YAML files
brew "yamllint"
# General-purpose lossless data-compression library
brew "zlib"
# Maven Daemon
brew "mvndaemon/mvnd/mvnd"
# VPN client that provides SAML authentication
cask "aviatrix-vpn-client"
# Compare files and folders
cask "beyond-compare"
# Free and open-source web browser
cask "chromium"
# Databases and SQL IDE
cask "datagrip"
# App to build and share containerized applications and microservices
cask "docker"
# Eclipse IDE for Java developers
cask "eclipse-java"
# Web browser
cask "firefox"
# Developer targeted fonts with a high number of glyphs
cask "font-caskaydia-cove-nerd-font"
cask "font-consolas-for-powerline"
# Developer targeted fonts with a high number of glyphs
cask "font-fira-code-nerd-font"
cask "font-menlo-for-powerline"
# Dotted-zero variant of the Meslo LG font
cask "font-meslo-lg-dz"
# Developer targeted fonts with a high number of glyphs
cask "font-meslo-lg-nerd-font"
# Personal blockchain for Ethereum development
cask "ganache"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
cask "graalvm-ce-java17"
cask "graalvm-ce-java19"
# Java IDE by JetBrains
cask "intellij-idea"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Control your tools with a few keystrokes
cask "raycast"
# Plugin for AWS CLI to start and end sessions that connect to managed instances
cask "session-manager-plugin"
# Video chat, voice call and instant messaging application
cask "skype"
# Team communication and collaboration software
cask "slack"
# API testing tool
cask "soapui"
# Text editor for code, markup and prose
cask "sublime-text"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin11"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin17"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin21"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin8"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Video communication and virtual meeting platform
cask "zoom"
vscode "alefragnani.Bookmarks"
vscode "alefragnani.project-manager"
vscode "AnbuselvanRocky.bootstrap5-vscode"
vscode "Angular.ng-template"
vscode "atlassian.atlascode"
vscode "awesomektvn.toggle-semicolon"
vscode "bierner.markdown-mermaid"
vscode "cyrilletuzi.angular-schematics"
vscode "DanielSanMedium.dscodegpt"
vscode "davidbabel.vscode-simpler-icons"
vscode "dbankier.vscode-quick-select"
vscode "developersoapbox.vscode-springboot-snippets"
vscode "dgileadi.java-decompiler"
vscode "DotJoshJohnson.xml"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "emeraldwalk.RunOnSave"
vscode "fabiospampinato.vscode-open-multiple-files"
vscode "formulahendry.auto-rename-tag"
vscode "ghaschel.vscode-angular-html"
vscode "GitHub.github-vscode-theme"
vscode "GitHub.vscode-pull-request-github"
vscode "GitLab.gitlab-workflow"
vscode "Gruntfuggly.global-config"
vscode "hashicorp.terraform"
vscode "huizhou.githd"
vscode "infinity1207.angular2-switcher"
vscode "ipedrazas.kubernetes-snippets"
vscode "jevakallio.vscode-hacker-typer"
vscode "johnpapa.Angular2"
vscode "JuanBlanco.solidity"
vscode "k--kato.intellij-idea-keybindings"
vscode "kaiwood.center-editor-window"
vscode "mathiasfrohlich.Kotlin"
vscode "mdickin.markdown-shortcuts"
vscode "mhutchie.git-graph"
vscode "michelemelluso.gitignore"
vscode "moshfeu.diff-merge"
vscode "mrmlnc.vscode-duplicate"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "msjsdiag.debugger-for-chrome"
vscode "nhoizey.gremlins"
vscode "obenjiro.arrr"
vscode "perennialinnocence.java-cfr-decompiler"
vscode "quicktype.quicktype"
vscode "redhat.fabric8-analytics"
vscode "redhat.java"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "richie5um2.vscode-sort-json"
vscode "ryuta46.multi-command"
vscode "Seudev.vscode-java-snippets"
vscode "shengchen.vscode-checkstyle"
vscode "SirTori.indenticator"
vscode "steoates.autoimport"
vscode "TabNine.tabnine-vscode"
vscode "trentrand.git-rebase-shortcuts"
vscode "trinm1709.dracula-theme-from-intellij"
vscode "tuxtina.json2yaml"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vmsynkov.colonize"
vscode "vmware.vscode-boot-dev-pack"
vscode "vmware.vscode-concourse"
vscode "vmware.vscode-manifest-yaml"
vscode "vmware.vscode-spring-boot"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-initializr"
vscode "wware.snippets-explorer"
vscode "xabikos.JavaScriptSnippets"
vscode "yatki.vscode-surround"
vscode "zerodind.familiar-java-themes"
vscode "zxh404.vscode-proto3"
