tap "adoptopenjdk/openjdk"
tap "graalvm/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "micronaut-projects/tap"
tap "mvndaemon/mvnd"
tap "square/formula", "org-49461806@github.com:squareup/homebrew-formulas.git"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Official Amazon AWS command-line interface
brew "awscli"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Core application library for C
brew "glib"
# Manage compile and link flags for libraries
brew "pkg-config"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Configurable talking characters in ASCII art
brew "cowsay"
# Tool for exploring each layer in a docker image
brew "dive"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Generic library support script
brew "libtool"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# OpenType text shaping engine
brew "harfbuzz"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Secure Reliable Transport
brew "srt"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg@4"
# GitHub command-line tool
brew "gh"
# Highest-quality GIF encoder based on pngquant
brew "gifski"
# Distributed revision control system
brew "git"
# X.509 and CMS library
brew "libksba"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg@1.4"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Reformats Java source code to comply with Google Java Style
brew "google-java-format"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# GNU grep, egrep and fgrep
brew "grep"
# Manage your Java environment
brew "jenv"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Sophisticated file transfer program
brew "lftp"
# YAML Parser
brew "libyaml"
# Java-based project management
brew "maven"
# HTTP/2 C Library
brew "nghttp2"
# Platform built on V8 to build network applications
brew "node"
# Manage multiple Node.js versions
brew "nvm"
# Development kit for the Java programming language
brew "openjdk@11"
# Object-relational database system
brew "postgresql@14"
# Python version management
brew "pyenv"
# Repository tool for Android development
brew "repo"
# Login and retrieve AWS temporary credentials using a SAML IDP
brew "saml2aws"
# Simple keystroke visualizer
brew "showkey"
# Organize software neatly under a single directory tree
brew "stow"
# Terraform version manager inspired by rbenv
brew "tfenv"
# Programmatically correct mistyped console commands
brew "thefuck"
# Tool for packaging, publishing and managing VS Code extensions
brew "vsce"
# Internet file retriever
brew "wget"
# General-purpose lossless data-compression library
brew "zlib"
# Maven Daemon
brew "mvndaemon/mvnd/mvnd"
brew "square/formula/aws-creds"
brew "square/formula/beyond-curl"

# VPN client that provides SAML authentication
cask "aviatrix-vpn-client"
# Compare files and folders
cask "beyond-compare"
# Free and open-source web browser
cask "chromium"
# Databases and SQL IDE
cask "datagrip"
# App to build and share containerized applications and microservices
cask "docker"
# Eclipse IDE for Java developers
cask "eclipse-java"
# Web browser
cask "firefox"
# Personal blockchain for Ethereum development
cask "ganache"
# Web browser
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
cask "graalvm-ce-java17"
cask "graalvm-ce-java19"
# Java IDE by JetBrains
cask "intellij-idea"
cask "micronaut"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Collaboration platform for API development
cask "postman"
# Control your tools with a few keystrokes
cask "raycast"
# Plugin for AWS CLI to start and end sessions that connect to managed instances
cask "session-manager-plugin"
# Video chat, voice call and instant messaging application
cask "skype"
# API testing tool
cask "soapui"
# Text editor for code, markup and prose
cask "sublime-text"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Video communication and virtual meeting platform
cask "zoom"
