tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"

# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Official Amazon AWS command-line interface
brew "awscli"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Manage compile and link flags for libraries
brew "pkg-config"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Tool for exploring each layer in a docker image
brew "dive"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Generic library support script
brew "libtool"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GitHub command-line tool
brew "gh"
# Highest-quality GIF encoder based on pngquant
brew "gifski"
# Distributed revision control system
brew "git"
# X.509 and CMS library
brew "libksba"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg@1.4"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Reformats Java source code to comply with Google Java Style
brew "google-java-format"
# GNU grep, egrep and fgrep
brew "grep"
# Manage your Java environment
brew "jenv"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Sophisticated file transfer program
brew "lftp"
# YAML Parser
brew "libyaml"
# Java-based project management
brew "maven"
# HTTP/2 C Library
brew "nghttp2"
# Platform built on V8 to build network applications
brew "node"
# Manage multiple Node.js versions
brew "nvm"
# Development kit for the Java programming language
brew "openjdk@11"
# Repository tool for Android development
brew "repo"
# Login and retrieve AWS temporary credentials using a SAML IDP
brew "saml2aws"
# Simple keystroke visualizer
brew "showkey"
# Organize software neatly under a single directory tree
brew "stow"
# Terraform version manager inspired by rbenv
brew "tfenv"
# Programmatically correct mistyped console commands
brew "thefuck"
# Internet file retriever
brew "wget"
# General-purpose lossless data-compression library
brew "zlib"

# VPN client that provides SAML authentication
cask "aviatrix-vpn-client"
# Compare files and folders
cask "beyond-compare"
# Free and open-source web browser
cask "chromium"
# Databases & SQL IDE
cask "datagrip"
# App to build and share containerized applications and microservices
cask "docker"
# Eclipse IDE for Java developers
cask "eclipse-java"
# Web browser
cask "firefox"
# Personal blockchain for Ethereum development
cask "ganache"
# Web browser
cask "google-chrome"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# Java IDE by JetBrains
cask "intellij-idea"
# Collaboration platform for API development
cask "postman"
# Utility to resize and position application windows
cask "sizeup"
# Text editor for code, markup and prose
cask "sublime-text"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin8"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin11"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin17"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
